PREVIEW = """
░█████╗░███╗░░░███╗░█████╗░███████╗░█████╗░███╗░░██╗  ██████╗░░█████╗░████████╗
██╔══██╗████╗░████║██╔══██╗╚════██║██╔══██╗████╗░██║  ██╔══██╗██╔══██╗╚══██╔══╝
███████║██╔████╔██║███████║░░███╔═╝██║░░██║██╔██╗██║  ██████╦╝██║░░██║░░░██║░░░
██╔══██║██║╚██╔╝██║██╔══██║██╔══╝░░██║░░██║██║╚████║  ██╔══██╗██║░░██║░░░██║░░░
██║░░██║██║░╚═╝░██║██║░░██║███████╗╚█████╔╝██║░╚███║  ██████╦╝╚█████╔╝░░░██║░░░
╚═╝░░╚═╝╚═╝░░░░░╚═╝╚═╝░░╚═╝╚══════╝░╚════╝░╚═╝░░╚══╝  ╚═════╝░░╚════╝░░░░╚═╝░░░
"""

PROFILE_TEXT = {
    'ENG': '''<b>
📁 My Account

👤 User: {username}
📝 Registered:  {reg_date}
👨‍💻 Verification:  {verif}
👥 Referrals:  {referal}

<a href="https://t.me/{BOT_NAME}?start={name.id}">Referral link</a>
</b>''',
    'RUS': '''<b>
📁 Личный кабинет

👤 Пользователь:  {username}
📝 Зарегистрирован:  {reg_date}
👨‍💻 Верификация:  {verif}
👥 Рефералов:  {referal}

<a href="https://t.me/{BOT_NAME}?start={name.id}">Реферальная ссылка</a>
</b>''',
    'UKR': '''<b>
📁 Особистий кабінет

👤 Користувач:  {username}
📝 Зареєстрований:  {reg_date}
👨‍💻 Верифікація:  {verif}
👥 Рефералов:  {referal}

<a href="https://t.me/{BOT_NAME}?start={name.id}">Реферальне посилання</a>
</b>''',
}


ACCEPT_LICENSE_TEXT = {
    'ENG': '''<b>
Rules
</b>''',
    'RUS': '''<b>
Правила
</b>''',
    'UKR': '''<b>
Правила
</b>''',
}


INFORMATION_TEXT = {
    'ENG': '''<b>
❓ Frequent questions and answers:

1. How does investing take place?
- Investing happens in the shortest possible time amid falling or rising assets.

2. How does the referral system work?
- After your friend clicks on your referral link you get bonuses for his activity (0.5% of each profitable transaction).
- It also affects your rating.

3. What is rating?
- Rating is an indicator of your activity on our site 📊
</b>''',
    'RUS': '''<b>
Amazon — самый огромный интернет-магазин в мире, имеющий отделения в 10 странах. В ассортименте магазина есть все 
от зубочисток до мебели. Обилие товаров, понятный интерфейс, быстрая доставка, отсутствие подделок и дружелюбная 
клиентская поддержка сделали этот магазин самым популярным в области интернет-покупок. Если вы опытный 
интернет-покупатель, то без сомнения уже зарегистрированы в каком-либо из отделений Amazon.
</b>''',
    'UKR': '''<b>
❓ Часті запитання та відповіді на них:

1. Як відбувається інвестування?
- Інвестування відбувається в найкоротші терміни на тлі падіння або зростання активів.

2. Як працює реферальна система?
- Після переходу товариша за вашим реферальним посиланням вам нараховуються бонуси за його активність (0.5% від кожної прибуткової угоди)
- Так само це впливає на ваш рейтинг.

3. що таке рейтинг?
- Рейтинг - це показник вашої активності на нашому майданчику 📊
</b>'''
}